# coding=UTF-8

something_wrong = 'Что-то пошло не так, попробуй всё (прям совсем всё) сначала'
user_already_signed_in = 'Ты уже зарегистрирован'
student_sign_in_guide = 'Привет, видимо, ты хочешь зарегистрироваться. Представься на первой строке в именительном, а на второй в творительном падеже, на третьей - свой класс, на четвертой - город и школу (Если ты не из ФМЛ №31). Вот так:\nСеня Чебыкин\nСеней Чебыкиным\n11В\nЧелябинск, ФМЛ №31'
teacher_sign_in_guide = 'Здравствуйте, видимо, вы хотите зарегистрироваться. Представтесь на первой строке в именительном, а на второй в творительном падеже.\n'
success_sign_in = "Отлично, спасибо большое! Скорее всего, прямо сейчас никакие функции работать не будут. Нужно скинуть мне расписание вашего класса в текстовом формате."
which_subject = 'Для какого предмета?'
help_str_teacher = 'Все общение с ботом происходит через /menu. Записка - любое послание ученикам, которое не является дз на конкретный день. Также можно оповестить о записке всех учеников класса. А еще поменять её. Если что-то не работает (работает не так как ожидается), сразу пишите мне, @nexus_chebykin'
abbvhelp_student = 'Информатика - inf, Геометрия - geo... (для умственно отсталых - первые 3 буквы в английском названии предмета) Английский у первой группы - eng1, у второй группы - eng2'
normal = '0123456789абвгдеёжзийклмнопрстуфхцчшщъыьэюя '
teacher_functions = ['Добавить записку',
                     'Мои записки',
                     "Добавить дз",
                     "Помощь"]
student_functions = ['Узнать дз на завтра', # Тимур
                     'Узнать дз', # Есть
                     'Добавить дз', # Есть
                     'Узнать решение', # ???
                     'Добавить решение', # ???
                     'Помощь с названиями предметов', # Есть
                     'Добавить записку', # Есть
                     'Посмотреть записки', # Есть
                     'Дополнительно'] # Есть
addition = ['Мои записки',
            'Помощь',
            '$$$']
home_task_storage = 'databases/ht.bn'
solution_storage = 'databases/sol.bn'
id_to_ind_storage = 'databases/us.bn'
users_storage = 'databases/users.bn'
notes_storage = 'databases/notes.bn'
rasp_storage = 'databases/rasp.bn'
stickers_storage = 'databases/sticks.bn'