# coding=UTF-8

something_wrong = 'Что-то пошло не так, попробуй всё снова'
user_already_signed_in = 'Ты уже зарегистрирован'
student_sign_in_guide = 'Привет, видимо, ты хочешь зарегистрироваться. Представься на первой строке в именительном, а на второй в творительном падеже, на третьей - свой класс, на четвертой - город и школу (Если ты не из ФМЛ №31). Вот так:\nСеня Чебыкин\nСеней Чебыкиным\n11В\nЧелябинск, ФМЛ №31'
teacher_sign_in_guide = 'Здравствуйте, видимо, вы хотите зарегистрироваться. Представтесь на первой строке в именительном, а на второй в творительном падеже.\n'
success_sign_in = "Отлично, спасибо большое!"
which_subject = 'Для какого предмета? (аббревиатуры в /abbvhelp)'
wrong_subject = 'Нет такого предмета'
help_str = 'Ты можешь загрузить (/addtask) в меня дз и выгрузить (/gettask). А еще было бы неплохо иногда загружать решения (/addsol))'
help_str_teacher = 'Вы можете загрузить домашнее задание (/addtask), или добавить заметку (/addnote).'
abbvhelp_student = 'Информатика - inf, Геометрия - geo... (для умственно отсталых - первые 3 буквы в английском названии предмета) Английский у первой группы - eng1, у второй группы - eng2'
normal = '0123456789абвгдеёжзийклмнопрстуфхцчшщъыьэюя '
teacher_functions = ['']
student_functions = ['Узнать дз на завтра', # Тимур
                     'Узнать дз', # Есть
                     'Добавить дз', # Есть
                     'Узнать решение', # ???
                     'Добавить решение', # ???
                     'Помощь с названиями предметов', # Есть
                     'Добавить записку', # Есть
                     'Посмотреть записки', # Есть
                     'Помощь'] # Есть
home_task_storage = 'databases/ht.bn'
solution_storage = 'databases/sol.bn'
id_to_ind_storage = 'databases/us.bn'
users_storage = 'databases/users.bn'
notes_storage = 'databases/notes.bn'
rasp_storage = 'databases/rasp.bn'
stickers_storage = 'databases/sticks.bn'