# coding=UTF-8
from classesnfunctions import *

something_wrong = 'Что-то пошло не так, попробуй всё снова'
user_already_signed_in = 'Ты уже зарегистрирован'
student_sign_in_guide = 'Привет, видимо, ты хочешь зарегистрироваться. Представься на первой строке в именительном, а на второй в творительном падеже, на третьей - свой класс, на четвертой - город и школу (Если ты не из ФМЛ №31). Вот так:\nСеня Чебыкин\nСеней Чебыкиным\n11В\nЧелябинск, ФМЛ №31'
teacher_sign_in_guide = 'Здравствуйте, видимо, вы хотите зарегистрироваться. Представтесь на первой строке в именительном, а на второй в творительном падеже.\n'
success_sign_in = "Отлично, спасибо большое!"
which_subject = 'Для какого предмета? (аббревиатуры в /abbvhelp)'
wrong_subject = 'Нет такого предмета'
help_str = 'Ты можешь загрузить (/addtask) в меня дз и выгрузить (/gettask). А еще было бы неплохо иногда загружать решения (/addsol))'
help_str_teacher = 'Вы можете загрузить домашнее задание (/addtask), или добавить заметку (/addnote).'
abbvhelp = 'Информатика - inf, Геометрия - geo... (для умственно отсталых - первые 3 буквы в нглийском названии предмета) Английский у Сметаны Барбарисовны - eng1, у *коронавирусной* - eng2'
normal = '0123456789абвгдеёжзийклмнопрстуфхцчшщъыьэюя '
teacher_functions = ['']
student_functions = ['Узнать дз',
                     'Добавить дз',
                     'Узнать решение',
                     'Добавить решение',
                     'Помощь с названиями предметов',
                     'Добавить записку',
                     'Посмотреть записки']
